---
kind: method
id: M:Autodesk.Revit.DB.TableSectionData.IsValidRowNumber(System.Int32)
source: html/6ea2a38c-5b86-11b1-9b51-bcca4ed13987.htm
---
# Autodesk.Revit.DB.TableSectionData.IsValidRowNumber Method

Verifies if the row number is valid.

## Syntax (C#)
```csharp
public bool IsValidRowNumber(
	int nRow
)
```

## Parameters
- **nRow** (`System.Int32`) - The row number.

## Returns
True if the row number is between FirstRowNumber and LastRowNumber, false otherwise.